[
  {
    "tag": "تحية",
    "patterns": [
      "مرحبا", 
      "هلا",
      "كيف حالك",
      "هل هناك أحد",
      "أهلا وسهلا",
      "يوم سعيد"
    ],
    "responses": [
      "أهلا بكم في موقع جامعتنا!",
      "مرحبا بكم! كيف يمكنني مساعدتكم في استفساراتكم؟",  
      "تحياتي! كيف يمكنني مساعدتكم اليوم؟",
      "مرحبا، وشكرا لزيارة موقعنا. كيف يمكنني مساعدتكم؟"
    ]
  },
  {
    "tag": "وداع",  
    "patterns": [
      "مع السلامة",
      "أراك لاحقا", 
      "وداعا"
    ],
    "responses": [
      "مع السلامة! إذا كان لديكم أي استفسارات أخرى، لا تترددوا في السؤال.",
      "شكرا لزيارتكم. يوم سعيد!",
      "خذوا حذركم ولكم يوم رائع! وداعا."
    ]
  },
  {
    "tag": "شكر", 
    "patterns": [
      "شكرا",
      "شكرا لك", 
      "هذا مفيد",
      "شكرا جزيلا!"
    ],
    "responses": [
      "العفو! إذا احتجت أي مساعدة إضافية، لا تتردد في السؤال.",
      "سعيد لأنني استطعت مساعدتك! إذا كان لديك أي استفسارات أخرى، لا تتردد في السؤال.",  
      "لا شكر على واجب! أخبرني إذا كان هناك أي شيء آخر يمكنني المساعدة فيه."
    ]
  },
  {
    "tag": "برامج",
    "patterns": [
      "ما هي البرامج التي تقدمها الجامعة؟",
      "ما هي المقررات المتاحة؟", 
      "أخبرني عن البرامج الأكاديمية",
      "هل يمكنك تقديم معلومات عن التخصصات؟" 
    ],
    "responses": [
      "تقدم جامعتنا مجموعة واسعة من البرامج في مختلف التخصصات. يمكنك العثور على معلومات مفصلة عن برامجنا الأكاديمية في قسم \"البرامج\" على موقعنا الإلكتروني.",
      "نقدم برامج أكاديمية متنوعة تشمل مجالات دراسية مختلفة. قم بزيارة قسم \"البرامج\" على موقعنا الإلكتروني للمزيد من المعلومات حول المقررات والتخصصات المتاحة."
    ]
  },
  {
    "tag": "القبول",
    "patterns": [
      "كيف يمكنني التقدم بطلب الالتحاق بالجامعة؟",
      "ما هي متطلبات القبول؟",
      "أخبرني عن عملية التقديم"  
    ],
    "responses": [
      "للتقدم بطلب للالتحاق بجامعتنا، يمكنك زيارة موقعنا الإلكتروني واتباع التعليمات الموجودة في قسم \"القبول\". تتوفر تفاصيل متطلبات وإجراءات القبول هناك. نحن نقدم أيضًا منحًا دراسية للطلاب المؤهلين، ويمكنك العثور على مزيد من المعلومات حولها على موقعنا الإلكتروني.",
      "لبدء عملية التقديم الخاصة بك، يرجى الرجوع إلى قسم \"القبول\" على موقعنا الإلكتروني. هناك، ستجد كافة المعلومات اللازمة بخصوص متطلبات القبول وإجراءات التقديم والمنح الدراسية المتاحة."
    ]
  },
  {
    "tag": "الرسوم الدراسية",
    "patterns": [
      "كم تبلغ رسوم الدراسة؟",
      "ما هي تكاليف الرسوم الدراسية؟",
      "أخبرني عن الجوانب المالية للالتحاق بالجامعة"
    ],
    "responses": [
      "تختلف رسوم الدراسة في جامعتنا باختلاف البرنامج والمستوى الأكاديمي. يمكنك العثور على معلومات مفصلة حول التكاليف على قسم \"الرسوم الدراسية والمساعدات المالية\" على موقعنا الإلكتروني. بالإضافة إلى ذلك، نقدم خيارات مساعدة مالية متنوعة لمساعدة الطلاب المؤهلين على إدارة نفقات تعليمهم.",
      "تقدم جامعتنا أسعارًا مختلفة للرسوم الدراسية بناءً على البرنامج ومستوى الدرجة. يرجى الرجوع إلى قسم \"الرسوم الدراسية والمساعدات المالية\" على موقعنا الإلكتروني للحصول على تفاصيل شاملة حول التكاليف. لدينا أيضًا فرص مساعدات مالية متاحة للطلاب المؤهلين."
    ]
  },
  {
    "tag": "الحرم الجامعي",
    "patterns": [
      "ما هي المرافق المتوفرة داخل الحرم الجامعي؟",
      "أخبرني عن الحرم الجامعي"
    ],
    "responses": [
      "يضم حرم جامعتنا مرافق عصرية، بما في ذلك فصول دراسية حديثة ومكتبات ومختبرات ومجمعات رياضية والمزيد. كما نقدم مجموعة متنوعة من الأنشطة الترفيهية والمنظمات الطلابية لتجربة متكاملة. للمزيد من المعلومات، يرجى استكشاف قسم \"الحياة في الحرم الجامعي\" على موقعنا الإلكتروني.",
      "يوفر حرم الجامعة مجموعة واسعة من المرافق لدعم الاحتياجات الأكاديمية والاجتماعية والترفيهية. من الفصول الدراسية المجهزة جيداً والمكتبات إلى مرافق الرياضة والأندية الطلابية، هناك شيء للجميع. تفقد قسم \"الحياة في الحرم الجامعي\" على موقعنا الإلكتروني لاكتشاف المزيد عن المرافق المتاحة."
    ]
  },
  {
    "tag": "اتصل بنا",
    "patterns": [
      "كيف يمكنني التواصل مع الجامعة؟",
      "أخبرني معلومات الاتصال",
      "هل يمكنك تزويدي برقم هاتف الجامعة وعنوان البريد الإلكتروني؟"  
    ],
    "responses": [
      "يمكنكم التواصل مع جامعتنا عن طريق الاتصال بالاستقبال الرئيسي على [رقم الهاتف] أو إرسال رسالة إلكترونية إلى [البريد الإلكتروني]. نحن نسعى إلى الرد بسرعة ومعالجة أي استفسارات أو مخاوف قد تكون لديكم.",
      "للتواصل المباشر، يمكنكم الاتصال بالاستقبال الرئيسي لجامعتنا على [رقم الهاتف]. إذا كنتم تفضلون البريد الإلكتروني، لا تترددوا في التواصل معنا على [البريد الإلكتروني]. نحن هنا لمساعدتكم!"
    ]
  }
]