
[
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hello! Welcome to our university's website.",
        "Hi there! How can I assist you with your inquiries?",
        "Greetings! How may I help you today?",
        "Hello, and thank you for visiting our website. How can I assist you?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye"
      ],
      "responses": [
        "Goodbye! If you have any more questions, feel free to ask.",
        "Thank you for visiting. Have a great day!",
        "Take care and have a wonderful day! Goodbye."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thank's a lot!"
      ],
      "responses": [
        "You're welcome! If you need any further assistance, feel free to ask.",
        "Glad I could help! If you have any more questions, feel free to ask.",
        "No problem! Let me know if there's anything else I can assist you with."
      ]
    },
    {
      "tag": "programs",
      "patterns": [
        "What programs does the university offer?",
        "Which courses are available?",
        "Tell me about the academic programs",
        "Can you provide information about the majors?"
      ],
      "responses": [
        "Our university offers a wide range of programs across various disciplines. You can find detailed information about our academic programs on our website's 'Programs' section.",
        "We provide diverse academic programs encompassing various fields of study. Visit our website's 'Programs' section for more information about the available courses and majors."
      ]
    },
    {
      "tag": "admissions",
      "patterns": [
        "How can I apply to the university?",
        "What are the admission requirements?",
        "Tell me about the application process"
      ],
      "responses": [
        "To apply to our university, you can visit our website and follow the instructions in the 'Admissions' section. The admission requirements and application process details are provided there. We also offer scholarships to eligible students, and you can find more information about them on our website.",
        "To begin your application process, please refer to the 'Admissions' section on our website. There, you will find all the necessary information regarding admission requirements, application procedures, and available scholarships."
      ]
    },
    {
      "tag": "tuition",
      "patterns": [
        "How much is the tuition fee?",
        "What are the tuition costs?",
        "Tell me about the financial aspects of attending the university"
      ],
      "responses": [
        "The tuition fees for our university vary depending on the program and academic level. You can find detailed information about the costs on our website's 'Tuition and Financial Aid' section. Additionally, we provide various financial aid options to assist eligible students in managing their education expenses.",
        "Our university offers different tuition rates based on the program and degree level. Please refer to the 'Tuition and Financial Aid' section on our website for comprehensive details about the costs. We also have financial aid opportunities available for qualified students."
      ]
    },
    {
      "tag": "campus",
      "patterns": [
        "What facilities are available on campus?",
        "Tell me about the university campus"
      ],
      "responses": [
        "Our university campus is equipped with state-of-the-art facilities, including modern classrooms, libraries, laboratories, sports complexes, and more. We also offer various recreational activities and student organizations for a well-rounded experience. For detailed information, please explore our website's 'Campus Life' section.",
        "The university campus provides a wide range of facilities to support academic, social, and recreational needs. From well-equipped classrooms and libraries to sports facilities and student clubs, there's something for everyone. Check out our website's 'Campus Life' section to discover more about the available amenities."
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "How can I contact the university?",
        "Tell me the contact information",
        "Can you provide the university's phone number and email address?"
      ],
      "responses": [
        "You can reach out to our university by calling our main reception at [phone number] or sending an email to [email address]. We strive to respond promptly and address any queries or concerns you may have.",
        "For direct communication, you can contact our university's main reception at [phone number]. If you prefer email, feel free to reach out to us at [email address]. We're here to assist you!"
      ]
    }
  ]

